config/cf/Documents/УчетДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УчетДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ОкончаниеОбслуживания</xr:Item>
				<xr:Item>Document.НачалоОбслуживания</xr:Item>
				<xr:Item>Document.Поступление</xr:Item>
				<xr:Item>Document.Продажа</xr:Item>
				<xr:Item>Document.НарядНаРаботы</xr:Item>
				<xr:Item>Document.ЛистУчетаРабочегоВремени</xr:Item>
				<xr:Item>Document.НачислениеЗаработнойПлаты</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаДокументов</xr:Item>
				<xr:Item>InformationRegister.Бюджеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетыПоОплачиваемымДокументам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДокументаУчетДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоОбслуживания</v8:Type>
						<v8:Type>cfg:DocumentRef.Продажа</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядНаРаботы</v8:Type>
						<v8:Type>cfg:DocumentRef.ОкончаниеОбслуживания</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗаработнойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛистУчетаРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПодразделения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеСтатьиДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиваемыйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоОбслуживания</v8:Type>
								<v8:Type>cfg:DocumentRef.Продажа</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядНаРаботы</v8:Type>
								<v8:Type>cfg:DocumentRef.ОкончаниеОбслуживания</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗаработнойПлаты</v8:Type>
								<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛистУчетаРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаработнаяПлата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисленияУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗаработнойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтраховыеВзносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисленияУдержания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗаработнойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидДокументаУчетДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидДокументаУчетДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаработнаяПлата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыОкончанияОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОкончанияОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееОбслуживаниеПроизведеноСразу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбслуживаниеКонтрагентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбслуживаниеКонтрагентомПроизведеноСразу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/СобытиеОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СобытиеОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Documents/УчетДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Оплата.Итог("Сумма");	
		
	Если (ПоложениеСтатьиДоходовРасходов = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке)
		ИЛИ (НЕ ЗначениеЗаполнено(ПоложениеСтатьиДоходовРасходов)) Тогда
		
		Для Каждого СтрокаТабличнойЧасти Из Оплата Цикл
			СтрокаТабличнойЧасти.СтатьяДоходовРасходов = СтатьяДоходовРасходов;
		КонецЦикла;
	Иначе		
		Если Оплата.Количество() > 0 Тогда
			СтатьяДоходовРасходов = Оплата[0].СтатьяДоходовРасходов;
		КонецЕсли;
	КонецЕсли;	
	
	Если (ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке) 
		ИЛИ (НЕ ЗначениеЗаполнено(ПоложениеПодразделения)) Тогда
		
		Для Каждого СтрокаТабличнойЧасти Из Оплата Цикл
			СтрокаТабличнойЧасти.Подразделение = Подразделение;
		КонецЦикла;
	Иначе		
		Если Оплата.Количество() > 0 Тогда
			Подразделение = Оплата[0].Подразделение;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;		
	КонецЕсли;
	
	Если ВидДокумента <> Перечисления.ВидДокументаУчетДенежныхСредств.ЗаработнаяПлата
		Или Не ЗначениеЗаполнено(ВидДокумента) Тогда 
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Для Каждого Строка Из Оплата Цикл
		Если Не ЗначениеЗаполнено(Строка.Заказ) И Не ЗначениеЗаполнено(Строка.ОплачиваемыйДокумент) Тогда
			ПроверяемыеРеквизиты.Добавить("Оплата.ОплачиваемыйДокумент");
		КонецЕсли;	
	КонецЦикла;
	
	ПроверяемыеРеквизиты.Добавить("ВидДокумента");
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеITОтделом8УФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	СЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	// Подготовка наборов записей.
	УправлениеITОтделом8УФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	СЛС.ОтразитьДвиженияВРазделахУчета(Ссылка, ДополнительныеСвойства, Движения, Отказ);
		
	// Запись наборов записей.
	УправлениеITОтделом8УФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	УправлениеITОтделом8УФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеITОтделом8УФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеITОтделом8УФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер, Дата, Проведен");
		Основание					= ДанныеЗаполнения;
		ПоложениеСтатьиДоходовРасходов		= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		ПоложениеПодразделения		= ДанныеЗаполнения.ПоложениеПодразделения;
		ВидДвижения 				= Перечисления.ВидыДоходовРасходов.Расход;
		Подразделение				= ДанныеЗаполнения.Подразделение;
		СтатьяДоходовРасходов		= ДанныеЗаполнения.СтатьяДоходовРасходов;
		БюджетыПоОплачиваемымДокументам = Истина;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПоставщику;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			
			НоваяСтрока						= Оплата.Добавить();			
			НоваяСтрока.Заказ				= Основание;
			НоваяСтрока.Описание			= Строки.Номенклатура;			
			НоваяСтрока.Сумма				= Строки.Всего;
			НоваяСтрока.СтатьяДоходовРасходов = 
				?(ПоложениеСтатьиДоходовРасходов = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
				СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
			НоваяСтрока.Подразделение		= ?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				Подразделение, Строки.Подразделение);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер, Дата, Проведен");
		Основание					= ДанныеЗаполнения;
		ПоложениеСтатьиДоходовРасходов= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		ВидДвижения 				= Перечисления.ВидыДоходовРасходов.Доход;
		СтатьяДоходовРасходов		= ДанныеЗаполнения.СтатьяДоходовРасходов;
		БюджетыПоОплачиваемымДокументам = Истина;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПокупателя;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			
			НоваяСтрока						= Оплата.Добавить();			
			НоваяСтрока.Заказ				= Основание;
			НоваяСтрока.Описание			= Строки.Номенклатура;			
			НоваяСтрока.Сумма				= Строки.Всего;
			НоваяСтрока.СтатьяДоходовРасходов = ?(ПоложениеСтатьиДоходовРасходов = 
				Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер, Дата, Проведен");
		Основание						= ДанныеЗаполнения;
		ПоложениеСтатьиДоходовРасходов			= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		ПоложениеПодразделения			= ДанныеЗаполнения.ПоложениеПодразделения;
		ВидДвижения						= Перечисления.ВидыДоходовРасходов.Расход;
		Подразделение					= ДанныеЗаполнения.Подразделение;
		СтатьяДоходовРасходов			= ДанныеЗаполнения.СтатьяДоходовРасходов;
		БюджетыПоОплачиваемымДокументам = Истина;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПоставщику;
		
		// Номенклатура.
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			
			НоваяСтрока						= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент= Основание;
			НоваяСтрока.Описание			= Строки.Номенклатура;			
			НоваяСтрока.Сумма				= Строки.Всего;
			НоваяСтрока.СтатьяДоходовРасходов = 
				?(ПоложениеСтатьиДоходовРасходов = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
				СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение = 
				?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
				Подразделение, Строки.Подразделение);
			
		КонецЦикла;
		
		// Услуги.
		Для Каждого Строки Из ДанныеЗаполнения.Услуги Цикл
			
			НоваяСтрока						= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент= Основание;				
			НоваяСтрока.Описание			= Строки.Номенклатура;
			НоваяСтрока.Сумма				= Строки.Всего;
			НоваяСтрока.СтатьяДоходовРасходов = 
				?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
				СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение = ?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				Подразделение, Строки.Подразделение);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОкончаниеОбслуживания") Тогда
		
		Если ДанныеЗаполнения.ВидОкончанияОбслуживания = Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентом
				ИЛИ ДанныеЗаполнения.ВидОкончанияОбслуживания = 
					Перечисления.ВидыОкончанияОбслуживания.ОбслуживаниеКонтрагентомПроизведеноСразу Тогда
					
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, 
				"Номер, Дата, Проведен, Автор, ДатаСоздания, АвторКорректировки, ДатаКорректировки");
			
			Основание					= ДанныеЗаполнения;			
			ВидДвижения					= Перечисления.ВидыДоходовРасходов.Расход;
			ПоложениеСтатьиДоходовРасходов		= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
			ПоложениеПодразделения		= ДанныеЗаполнения.ПоложениеПодразделения;
			Подразделение				= ДанныеЗаполнения.Подразделение;
			СтатьяДоходовРасходов		= ДанныеЗаполнения.СтатьяДоходовРасходов;
			БюджетыПоОплачиваемымДокументам = Истина;
			ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПоставщику;
			
			Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
				
				Если Строки.Событие = Перечисления.СобытиеОбслуживания.Добавление Тогда
					НоваяСтрока						= Оплата.Добавить();
					НоваяСтрока.ОплачиваемыйДокумент= Основание;
					НоваяСтрока.СтатьяДоходовРасходов = 
						?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
						СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
						
					НоваяСтрока.Подразделение	= ?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
						Подразделение, Строки.Подразделение);
						
					НоваяСтрока.Описание		= Строки.Номенклатура;
					НоваяСтрока.Сумма			= Строки.Всего;
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Строки Из ДанныеЗаполнения.Услуги Цикл
				
				НоваяСтрока						 = Оплата.Добавить();
				НоваяСтрока.ОплачиваемыйДокумент = Основание;
				НоваяСтрока.СтатьяДоходовРасходов = 
					?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
					СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
					
				НоваяСтрока.Подразделение = 
					?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
					Подразделение, Строки.Подразделение);
					
				НоваяСтрока.Описание			= Строки.Номенклатура;
				НоваяСтрока.Сумма				= Строки.Всего;
				
			КонецЦикла;			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачалоОбслуживания") Тогда
		
		Если ДанныеЗаполнения.ВидНачалаОбслуживания = Перечисления.ВидыНачалаОбслуживания.ОбслуживаниеКонтрагентом Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,
				"Номер, Дата, Проведен, Автор, ДатаСоздания, АвторКорректировки, ДатаКорректировки");
			
			Основание					= ДанныеЗаполнения;			
			ВидДвижения					= Перечисления.ВидыДоходовРасходов.Расход;
			ПоложениеСтатьиДоходовРасходов = ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
			ПоложениеПодразделения		= ДанныеЗаполнения.ПоложениеПодразделения;
			Подразделение				= ДанныеЗаполнения.Подразделение;
			СтатьяДоходовРасходов		= ДанныеЗаполнения.СтатьяДоходовРасходов;
			БюджетыПоОплачиваемымДокументам = Истина;
			ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПоставщику;
			
			Для Каждого Строки Из ДанныеЗаполнения.Услуги Цикл
				
				НоваяСтрока						= Оплата.Добавить();
				НоваяСтрока.ОплачиваемыйДокумент = Основание;
				НоваяСтрока.СтатьяДоходовРасходов = 
					?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
					СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
					
				НоваяСтрока.Подразделение		= ?(ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
					Подразделение, Строки.Подразделение);
					
				НоваяСтрока.Описание			= Строки.Номенклатура;
				НоваяСтрока.Сумма				= Строки.Всего;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, 
			"Номер, Дата, Проведен, Автор, ДатаСоздания, АвторКорректировки, ДатаКорректировки");
		
		Основание					= ДанныеЗаполнения;
		ВидДвижения					= Перечисления.ВидыДоходовРасходов.Доход;
		ПоложениеСтатьиДоходовРасходов = ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		ПоложениеПодразделения		= Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		Подразделение				= ДанныеЗаполнения.Подразделение;
		СтатьяДоходовРасходов		= ДанныеЗаполнения.СтатьяДоходовРасходов;
		БюджетыПоОплачиваемымДокументам = Истина;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПокупателя;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			
			НоваяСтрока						= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент= Основание;
			НоваяСтрока.СтатьяДоходовРасходов = 
				?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке, 
				СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение		= Подразделение;
			НоваяСтрока.Описание			= Строки.Номенклатура;
			НоваяСтрока.Сумма				= Строки.Всего;
			
		КонецЦикла;
		
		Для Каждого Строки Из ДанныеЗаполнения.Услуги Цикл
			
			НоваяСтрока						= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент= Основание;
			НоваяСтрока.СтатьяДоходовРасходов = 
				?(ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение		= Подразделение;
			НоваяСтрока.Описание			= Строки.Номенклатура;
			НоваяСтрока.Сумма				= Строки.Всего;
			
		КонецЦикла;		
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НарядНаРаботы") Тогда
				
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, 
			"Номер, Дата, Проведен, Автор, ДатаСоздания, АвторКорректировки, ДатаКорректировки");
		
		Основание						= ДанныеЗаполнения;
		ВидДвижения						= Перечисления.ВидыДоходовРасходов.Доход;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПокупателя;
		БюджетыПоОплачиваемымДокументам = Истина;
		ЗаполнитьПоНарядуНаРаботы(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистУчетаРабочегоВремени") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, ,
			"Номер, Дата, Проведен, Автор, ДатаСоздания, АвторКорректировки, ДатаКорректировки");
		
		Основание	= ДанныеЗаполнения;
		ВидДвижения	= Перечисления.ВидыДоходовРасходов.Доход;
		
		Для Каждого Строки Из ДанныеЗаполнения.НарядыНаРаботы Цикл
			
			ЗаполнитьПоНарядуНаРаботы(Строки.Наряд);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") Тогда
		
		Организация						= ДанныеЗаполнения.Организация;
		Комментарий						= ДанныеЗаполнения.Тема;
		Основание						= ДанныеЗаполнения;
		ПоложениеСтатьиДоходовРасходов 	= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		ВидДвижения						= Перечисления.ВидыДоходовРасходов.Доход;
		ВидДокумента					= Перечисления.ВидДокументаУчетДенежныхСредств.ОплатаПокупателя;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗаработнойПлаты") Тогда 
		
		Организация								= ДанныеЗаполнения.Организация;
		Подразделение							= ДанныеЗаполнения.Подразделение;
		ВидДокумента							= Перечисления.ВидДокументаУчетДенежныхСредств.ЗаработнаяПлата;
		СтатьяДоходовРасходов					= ДанныеЗаполнения.СтатьяДоходовРасходов;
		Бюджет									= ДанныеЗаполнения.Бюджет;
		ПериодБюджета							= ДанныеЗаполнения.ПериодБюджета;
		Комментарий								= ДанныеЗаполнения.Комментарий;
		Основание								= ДанныеЗаполнения; 
		НомерВходящегоДокумента					= ДанныеЗаполнения.Номер;
		ДатаВходящегоДокумента					= ДанныеЗаполнения.Дата;
				
		НоваяСтрока								= Оплата.Добавить();
		НоваяСтрока.ОплачиваемыйДокумент		= ДанныеЗаполнения;
		НоваяСтрока.Подразделение				= ДанныеЗаполнения.Подразделение;
		НоваяСтрока.Сумма						= ДанныеЗаполнения.СуммаДокумента;
		
		Для Каждого Строки Из ДанныеЗаполнения.НачисленияУдержания Цикл
			НоваяСтрока							= ЗаработнаяПлата.Добавить();
			НоваяСтрока.Сотрудник				= Строки.Сотрудник;
			НоваяСтрока.Подразделение			= ДанныеЗаполнения.Подразделение;
			НоваяСтрока.СтатьяДоходовРасходов	= ДанныеЗаполнения.СтатьяДоходовРасходов;
			НоваяСтрока.МесяцНачисления			= ДанныеЗаполнения.МесяцНачисления;
			НоваяСтрока.ВидНачисленияУдержания	= Строки.ВидНачисленияУдержания;
			НоваяСтрока.Сумма					= Строки.Сумма;
			НоваяСтрока.Регистратор				= ДанныеЗаполнения;
		КонецЦикла;
		
		Для Каждого Строки Из ДанныеЗаполнения.НалогиНаДоходы Цикл
			НоваяСтрока							= ЗаработнаяПлата.Добавить();
			НоваяСтрока.Сотрудник				= Строки.Сотрудник;
			НоваяСтрока.Подразделение			= ДанныеЗаполнения.Подразделение;
			НоваяСтрока.СтатьяДоходовРасходов	= ДанныеЗаполнения.СтатьяДоходовРасходов;
			НоваяСтрока.МесяцНачисления			= ДанныеЗаполнения.МесяцНачисления;
			НоваяСтрока.ВидНачисленияУдержания	= Строки.ВидНачисленияУдержания;
			НоваяСтрока.Сумма					= Строки.Сумма;
			НоваяСтрока.Регистратор				= ДанныеЗаполнения;
		КонецЦикла;
		
		Для Каждого Строки Из ДанныеЗаполнения.СтраховыеВзносы Цикл
			НоваяСтрока							= СтраховыеВзносы.Добавить();
			НоваяСтрока.Сотрудник				= Строки.Сотрудник;
			НоваяСтрока.МесяцНачисления			= ДанныеЗаполнения.МесяцНачисления;
			НоваяСтрока.ВидНачисленияУдержания	= Строки.ВидНачисленияУдержания;
			НоваяСтрока.Сумма					= Строки.Сумма;
			НоваяСтрока.Регистратор				= ДанныеЗаполнения;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти	

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоНарядуНаРаботы(ДанныеЗаполнения)
		
	Для Каждого Строки Из ДанныеЗаполнения.Работы Цикл
		
		Если Строки.Всего > 0 Тогда
			НоваяСтрока							= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент	= Основание;
			НоваяСтрока.СтатьяДоходовРасходов 	= 
				?(ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				ДанныеЗаполнения.СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение			= 
				?(ДанныеЗаполнения.ПоложениеРеквизитаПользователь  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				ДанныеЗаполнения.Подразделение, Строки.Подразделение);
				
			НоваяСтрока.Описание				= Строки.Услуга;
			НоваяСтрока.Сумма					= Строки.Всего;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
		
		Если Строки.Всего > 0 Тогда
			НоваяСтрока							= Оплата.Добавить();
			НоваяСтрока.ОплачиваемыйДокумент	= Основание;
			НоваяСтрока.СтатьяДоходовРасходов 	= 
				?(ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов  = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке,
				ДанныеЗаполнения.СтатьяДоходовРасходов, Строки.СтатьяДоходовРасходов);
				
			НоваяСтрока.Подразделение			= Строки.Подразделение;
			НоваяСтрока.Описание				= Строки.Номенклатура;
			НоваяСтрока.Сумма					= Строки.Всего;
		КонецЕсли;
		
    КонецЦикла;   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), 
		?(ЗначениеЗаполнено(Данные.ВидДокумента), Строка(Данные.ВидДокумента), 
			НСтр("ru = 'Учет денежных средств'")),
		Данные.Номер,
		Данные.Дата);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидДокумента");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
